
// Задача 1

// Для каждого принципа ООП приведите 2-3 примера из жизни.

/*
 
Абстракция

1. Монитор
 отображение информации

2. Велосипед
 педали
 два колеса

 
Инкапсуляция

 1. Самолёт
 Винтовой самолёт
 
 2. Самолёт
 Реактивный самолёт
 
 
Наследование
 
 1. Физическая клавиатура
 Сенсорная клавиатура
 2. Шариковая мыш
 Оптическая мыш
 
 
Полиморфизм

1. Разгрузка грузовиков
 Автопогрузчик

2. Операции на складе
 Автопогрузчик

*/



// Задача 2 Для каждого базового понятия ООП приведите 2-3 примера из жизни. Опишите их текстом.

/*
 
 Класс - Самолёт
 
 Двигатель
 Фюзеляж
 Шасси
 Крылья
 
 Подача топлива в двигатели
 Погрузка
 Разгрузка
 Взлет
 
 
 Класс - Велосипед
 
 Колеса
 Рама
 Руль
 Педали
 
 Крутить педали
 
 
 
 Объект - Самолёт
 
 Экземпляр класса Самолёт
 Самолёты с разным количеством двигателей
 
 
 Объект - Велосипед
 
 Экземпляр класса Велосипед
 Горный велосипед
 Спортивный велосипед
 
 
 
 Свойства объекта Самолёт
 
 Размах крыльев
 Грузоподьемность
 Цвет
 
 
 Свойства объекта Велосипед
 
 Количество скоростей
 Размер колес
 
 
 
 Методы - Самолёта
 
 Загрузка груза
 Перелет
 
 Методы - Велосипеда
 Перемещение
 
 
 
 */
